import random
import time

# Привітання та авторизація
print("Привіт!✨")
print("Будь ласка, введи своє ім'я")
nickname = input()
print(f"Приємно познайомитися, {nickname}")
print("Вітаю в грі <<Вгадай число>>")
time.sleep(3)

# Інструкція до гри
print("^^^" * 50)
print("ПРАВИЛА ГРИ:")
print("Комп'ютер обирає ціле число від 1 до 50 включно.")
print("Тобі потрібно його відгадати за 6 спроб.")
print("Якщо твоє число менше, я скажу 'Моє число більше'.")
print("Якщо твоє число більше, я скажу 'Моє число менше'.")
print("^^^" * 50)
time.sleep(5)