import random
import time

VARIANT=list(range(1,51))

print("Привіт!✨")
#авторизація
print("Будь ласка, введи своє ім'я")
nickname = input()
print(f"Приємно познайомитися, {nickname}")
print("Вітаю в грі <<Вгадай число>>")
time.sleep(3)
#інструкція до гри
print("^^^"*100)
print("ПРАВИЛА ГРИ:\n Комп'ютер обирає будь-яке ціле число від 1 до 50 включно.\n Ти маєш відгадати його за 5 раундів.\n Якщо твоє число менше за загадане програма видасть 'Моє число більше', якщо твоє число більше за загадане, то програма видасть 'Моє число менше'.")
print("^^^"*100)
time.sleep(10)
print("Якщо ти готовий напиши 'Go'")
start = input()
while start!="Go":
    print("Перечитай уважніше правила гри🌞")
    start=input()
print("Let's go")

